In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

df= pd.read_csv('Marks.csv')
df

     number_courses  time_study   Marks
0                 3       4.508  19.202
1                 4       0.096   7.734
2                 4       3.133  13.811
3                 6       7.909  53.018
4                 8       7.811  55.299
..              ...         ...     ...
96                3       0.301   5.609
97                4       7.163  41.444
98                7       0.309  12.027
99                3       6.335  32.357
100               4       3.210     NaN

[101 rows x 3 columns]

# Info() is a function of Pandas

In [2]:
# Info function is used to tell Number of entries means Rows & Columns | Columns Data types & how many non null columns

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 101 entries, 0 to 100
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   number_courses  101 non-null    int64
 1   time_study      101 non-null    float64
 2   Marks           100 non-null    float64
dtypes: float64(2), int64(1)
memory usage: 2.5 KB

# isnull()

In [4]:
# isnull() is used to find Null values in the table

In [5]:
df.isnull()

     number_courses  time_study  Marks
0             False       False  False
1             False       False  False
2             False       False  False
3             False       False  False
4             False       False  False
..              ...         ...    ...
96            False       False  False
97            False       False  False
98            False       False  False
99            False       False  False
100           False       False   True

[101 rows x 3 columns]

In [6]:
# isnull().sum() is used to find numbers of NAN value present in table

In [7]:
df.isnull().sum()

number_courses    0
time_study        0
Marks             1
dtype: int64

In [8]:
# fillna is used to convert NAN value to numeric value | .replace is used to replace value

In [9]:
df["Marks"] = df["Marks"].fillna(3)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 101 entries, 0 to 100
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   number_courses  101 non-null    int64
 1   time_study      101 non-null    float64
 2   Marks           101 non-null    float64
dtypes: float64(2), int64(1)
memory usage: 2.5 KB

In [11]:
df.isnull()

     number_courses  time_study  Marks
0             False       False  False
1             False       False  False
2             False       False  False
3             False       False  False
4             False       False  False
..              ...         ...    ...
96            False       False  False
97            False       False  False
98            False       False  False
99            False       False  False
100           False       False  False

[101 rows x 3 columns]

In [12]:
df.isnull().sum()

number_courses    0
time_study        0
Marks             0
dtype: int64

In [13]:
df.isnull().sum().sum()

np.int64(0)

# describe()

In [14]:
# describe() is used to view table in breif

In [15]:
df.describe()

       number_courses  time_study       Marks
count      101.000000  101.000000  101.000000
mean         5.277228    4.068554   24.205634
std          1.795098    2.362596   14.412818
min          3.000000    0.096000    3.000000
25%          4.000000    2.061000   12.591000
50%          5.000000    3.977000   19.771000
75%          7.000000    6.173000   36.653000
max          8.000000    7.957000   55.299000

In [17]:
df.head(20)   # first 20 rows
df.tail(20)   # last 20 rows

     number_courses  time_study   Marks
81                8       2.262  17.705
82                4       7.410  44.099
83                5       3.197  16.106
84                8       1.982  16.461
85                8       6.201  39.957
86                7       4.067  23.149
87                3       1.033   6.053
88                5       1.803  11.253
89                7       6.376  40.024
90                7       4.182  24.394
91                8       2.730  19.564
92                4       5.027  23.916
93                8       6.471  42.426
94                8       3.919  24.451
95                6       3.561  19.128
96                3       0.301   5.609
97                4       7.163  41.444
98                7       0.309  12.027
99                3       6.335  32.357
100               4       3.210   3.000